app/views/users/show.html.erb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 5]]
---
  <strong>MicroPosts:</strong>
  <% @user.microposts.each do |post| %>